'''
------------算術運算符 Arithmetic Operator-------------
加(+)、減(-)、乘(*)、除(/)、整除(//)、取餘(%)、冪運算(**)
'''

print(13+5) # 加法運算
print(13-5) # 減法運算
print(13*5) # 乘法運算
print(13/5) # 除法運算
print(13//5) # 整除運算(僅取整數商)
print(13%5) # 取餘運算(僅取餘數)
print(13**5) # 冪運算

print('------------詳細的 //  ----------------')

print(9//4)    # 2
print(-9//-4)  # 2
print(-9//4)   # -3
print(9//-4)   # -3 , 會向下取整

print('------------詳細的 %  ----------------')

print(9%4)    # 1
print(-9%-4)  # -1
print(-9%4)   # 3
print(9%-4)   # -3 
'''
取餘公式為 if a=b//c....d
d=a-b*c ( d 就是取餘的結果)
'''